{
  "comments_id": "43681658",
  "rank": 10,
  "title": "Canadian math prodigy allegedly stole $65M in crypto",
  "link": "https://www.theglobeandmail.com/business/economy/article-math-prodigy-cryptocurrency-enforcement-united-states/",
  "created_date": "2025-04-15T23:55:23.469691",
  "comments_summary": "この記事は、Indexed Financeから5000万ドルを不正に引き出したとして、カナダ人のアンドレアン・メデジョビッチが米国で告発された事件についてです。\n\n## コードは契約か、法律か？\n\n*   ニキズルは、暗号通貨業界が日和見主義的に「コードは契約である」か「法律に支配される」かを都合の良いように使い分けていると批判しています。イントラサイトは、現実のお金が絡むと純粋主義は消え去ると指摘しています。クリデルは、コードは契約だが、紛争は裁判所によって処理されるべきだと述べています。\n\n*   ヒンクレーは、現実世界ではロックは正直者を正直に保ち、不正直な者が気づかれるまで遅らせるものだと述べ、仮想通貨も同様に販売できる可能性があると示唆しています。Gunaxは、法律はコードよりも優先される可能性があり、財産法をコードで上書きできないことを示唆しています。プログラムジェームズは、スマートコントラクトが少額の損失で自動的に停止しないことが信じられないと述べています。\n\n## 盗み vs. ゲームに勝つ\n\n*   アミット9グプタは、メデジョビッチは誰も盗んでおらず、Indexed Financeを打ち負かしただけだと主張しています。Cthulhu_は、企業とその顧客はリスクを承知していたはずだと述べ、法律の保護を求めるなら、金融機関はライセンスを取得してすべての規則に従う必要があると指摘します。アーオニスは、誰かが法律を破ったからといって、第三者がその資金を盗む権利があるわけではないと反論しています。\n\n*   アーコンテスは「盗み」の定義に疑問を呈し、契約が満たされた場合に資金を支払うように指示された弁護士が契約を満たした人に資金を支払った場合、それは盗みではないと主張しています。ダニエルVFは、この状況に似たXKCDの漫画を紹介しています。インデュビオプロルビオは、無能な金融会社を皮肉っています。インサイドアウトサンタは、暗号通貨を設計通りに使用した場合は裁判所に訴えるべきではないと主張し、暗号通貨の存在意義に疑問を呈しています。\n\n*   thinkingtoiletは、暗号通貨の目的は違法な取引を実行し、規制の欠如を利用して金融知識のない人々を搾取することだと主張しています。힌クレーは、マネーロンダリングが目的だと指摘しています。apercuは、手っ取り早い金儲け詐欺や詐欺も目的だと付け加えています。\n\n## 暗号通貨の存在意義\n\n*   フォンノイマンスタンは、裁判所はハッカーがコンピュータネットワークを悪用した場合と同様に、スマートコントラクトも同様に扱うと示唆しています。jstanleyは、セキュリティが盗難を防ぐのに不十分だったとしても、盗難が合法になるわけではないと指摘し、裁判所が依然として重要であることを強調しています。croteは、暗号通貨契約はセキュリティではなく、契約として設計されていると説明しています。notahackerは、スマートコントラクトが第三者の監視なしに信頼性の高い交換を可能にすることを意図していると付け加えています。dandanuaは、安全に資金を保管できるサービスを提供しながら、他の誰かが資金を奪うことを許容するビジネスモデルは、当然の結果だと述べています。yifanlは、彼らが破産に値するという事実は、破産の責任者が無罪であるという意味ではないと反論しています。\n\n*   InsideOutSantaは、暗号通貨の目的は政府の金融システムへの介入を回避することではないと主張し、法制度に頼ることは暗号通貨の存在意義を否定すると述べています。hinkleyは、現金は政府が発行する法定通貨であることを指摘しています。koolbaは、個人キーを盗んで資産を盗むことと、手っ取り早い金儲けスキームの抜け穴を悪用することとは異なると主張しています。Muromecは、手段は異なるが、意図は同じだと反論しています。lelandbateyは、契約を作成し、特定の条件下で暗号通貨が移動できることを明記した場合、その条件を満たした人が暗号通貨を移動させても犯罪ではないと主張しています。\n\n*   tempfileは、暗号通貨を施錠されていない家に例え、泥棒が盗んだものを保持すべきではないと主張しています。DangitBobbyは、住宅を従来の金融から逃れるために使用することではないと反論しています。InsideOutSantaは、暗号通貨会社が契約に従うように指示し、顧客が契約に従って資金を引き出した場合、その行為は許容されるべきだと主張しています。tempfileは、「意図したもの」と「望んでいたもの」を区別できない場合、議論は無意味になると反論しています。\n\n## まとめ\n\nこのディスカッションでは、アンドレアン・メデジョビッチの事件を中心に、暗号通貨の「コードは法律である」という原則について、さまざまな意見が交わされました。一部の参加者は、メデジョビッチは単純にシステムを打ち負かしただけであり、スマートコントラクトのコードに定められたルールに従っただけだと主張しています。一方、他の参加者は、意図が重要であり、抜け穴を利用することは依然として盗みや詐欺に該当する可能性があると主張しています。この議論では、暗号通貨の目的、法制度との関係、分散型金融の倫理的影響についても触れられています。"
}