{
  "comments_id": "43716058",
  "rank": 2,
  "title": "An intro to DeepSeek's distributed file system",
  "link": "https://maknee.github.io/blog/2025/3FS-Performance-Journal-1/",
  "created_date": "2025-04-17T20:12:21.113492",
  "comments_summary": "この Hacker News のスレッドでは、DeepSeek が開発した分散ファイルシステムである 3FS について議論されています。\n\n## ZFS のスケールアウト\n\nZFS はスケールアウトするように設計されていません。ファイバーチャネルを使用して大量のディスクを単一のサーバーに接続し、それらすべてを使用して単一の ZFS プールを作成することはできますが、単一のサーバーが処理できる 1 秒あたりのリクエスト数によって制限されます。\n\n## 既存の分散ファイルシステムとの比較\n\n既存のオープンソースの分散ファイルシステムが多数存在します。3FS は、おそらく HFT のバックグラウンドを持つ著者によって、既製のソリューションの設計範囲外であるワークロードのために開発されました。主な機能は、PB 規模のストレージ、読み取り/書き込みの並列性、冗長性です。一貫性は達成が難しく、ここでは役に立たないようです。\n\n## 一貫性の重要性\n\n大規模なデータプラットフォームを運用する場合、特にクラウドでは、時間の経過とともに多くのノードが失われることがよくあります。トレーニングジョブが、必要なブロックが特定のノードにないという理由だけで再起動する必要がないように、堅牢な一貫性/複製メカニズムが不可欠です。\n\n## アーキテクチャと関連システム\n\n3FS はスケールアウトメタデータファイルシステムです。関連する分散ファイルシステムには、Colossus、Tectonic (Meta)、ADLSv2 (Microsoft)、HopsFS (Hopsworks)、PolarFS (Alibaba) などがあります。これらはすべて、メタデータの保存に異なる分散行指向 DB を使用します。3FS で重要なのは、(1) FUSE クライアントのサポート (生活を非常に楽にします)、(2) NVMe ストレージのサポート (トレーニングパイプラインがディスク I/O に制限されないようにするため) です。\n\n## CephFS の代替としての検討\n\nCephFS は、実際のシナリオで徹底的にテストされており、ペタバイト規模でも信頼性があることが示されています。オープンソースソリューションとして、最速の NVMe ストレージで実行でき、10 ギガビット以上のインターコネクトで非常に高い IOPS を実現できます。ただし、CephFS は管理が複雑で、調整が難しい場合があります。また、OSD は NVMe ドライブを念頭に置いて設計されていません。\n\n## クラウドストレージとの比較\n\n3FS を AWS で実行する場合、選択するレプリケーション係数に応じて、FSx for Lustre よりも約 12〜30% 安価に実行できます。ただし、クラスターを自分で管理する必要があります。AWS は、1GB/s を得るためだけにマルチ TB ディスクを必要とせずに、高速な NVMe を利用できるようにする必要があります。\n\n## バックアップとリカバリ\n\nアクティブデータの場合、システム内のレプリケーションは、インスタンスの障害からデータを維持するのに十分です。バックアップとリカバリは、主に「rm -rf /」のようなコマンドから保護するために使用されます。バックアップは、セカンダリデータセンターに配置されることが一般的です。ハードウェアの障害は冗長性によって処理され、ファットフィンガーはファイルシステムに保持されているスナップショットによって処理されます。\n\n## セキュリティ上の懸念\n\n自己ホスト型ファイルシステムに、データを流出させるためのバックドアがあることを心配するのは奇妙なことです。これらの種類のサービスをパブリックインターネットに公開したり、パブリックインターネットへのアクセスを許可したりしないでください。\n\n## SeaweedFS および JuiceFS との比較\n\nSeaweedFS は、メタデータをクエリする必要がないため、優れた小規模オブジェクトの読み取りパフォーマンスを実現します。3FS は POSIX インターフェイスをサポートしており、大規模なファイルからランダムに読み取るのが非常に高速です。JuiceFS はデータを S3 に保存するため、非常に安価ですが、レイテンシが高くなります。\n\n## まとめ\n\n3FS は、特に AI ワークロード向けに設計された分散ファイルシステムです。既存のソリューションと比較して、パフォーマンス、スケーラビリティ、およびコストのバランスを提供します。ただし、管理が複雑になる可能性があり、セキュリティ上の懸念も考慮する必要があります。"
}