{
  "comments_id": "43773813",
  "rank": 3,
  "title": "AI Horseless Carriages",
  "link": "https://koomen.dev/essays/horseless-carriages/",
  "created_date": "2025-04-23T20:13:23.902427",
  "comments_summary": "コメントは、LLMが既存の製品に統合された、表面的なAI機能について議論しています。スレッドでは、AIによって生成されたプリフィルされた応答から、会議メモ作成やプログラミング支援のためのより多くのユースケースまで、さまざまなAI機能の有用性について議論しています。\n\n## 大企業におけるAIの安全性と品質のトレードオフ\n\noceanplexianは、AIが自然に予測可能な文章スタイルを生み出すと多くの人が考えているが、そうではないと主張しています。彼らは、大手企業がモデルの安全性に配慮し、人々がAIの真の能力を知った場合に引き起こされる可能性のある不安を軽減するために、不気味の谷を意図的に組み込んでいるという独自の理論を提案しています。彼らの意見では、AIが人間のように「話す」ことができれば、人々は不安になるだろう。\n\n## AI機能の有用性\n\njoshstrangeは、AIコーディング機能を除いて、AI機能を楽しむことに苦労していることを表明しています。彼らは、多くのAI機能は使い物にならず、価格も法外であると考えています。彼らの視点に呼応して、apwell23は、ガーミンがコネクトプラスでAI生成のワークアウトメッセージに対して課金しようとしていることに不満を表明し、それが最もばかげたAIスロップであると述べています。同様に、danielblnはストラバの統合を不十分だと批判し、nradovはAI機能をオフにできることを望んでいます。\n\n対照的に、Andugalは、会議に多く参加する場合、AIノートテイカーがノートを取り、構造化された要約、フォローアップメール、タスクリストなどを生成することは非常に役立つと考えています。\n\n## AIノートテイカー\n\nAlexandrBは、実際に誰かがこの種のものを読んでいるのか疑問を呈しています。bluGillは、過去の会議のノートが役立つことを示唆し、namariaは100%正確なノートを生成できるLLMを求めています。joshstrangeは、AIノートテイカーが間違いを犯し、ノートテイカーが会議を「終了」するための優れた方法がないという経験を共有しています。彼らは、AIノートテイカーが会議への参加者の代わりに会議に参加することにも反対しています。\n\n## その他のAIのユースケース\n\ndanielblnは、一般的な目的のチャットボットとして、または一般的なアイデア出しのために、Claudeを楽しんでいます。nicolas_tは、関連する公開研究への参照を含むトピックの概要をすばやく把握する必要がある場合に、Perplexityを使用することを好みます。teerayは、LLMが電子メールを要約することの利点を示唆しています。sanderjdは、コードコパイロットに加えて、すでに非常に役立つもう1つのアプリケーションは、Notion AIのようなRAGベースの情報検出であると考えています。giancarlostoroは、AIがスタックトレースをより迅速にデバッグできると考えています。彼らは、LLMがそれ自体ではそうではないにしても、優れた足場ツールになる可能性があるとも述べています。\n\n## 馬のない馬車\n\nthemanneranは、多くの企業の接着剤タイプのAIロールアウトにも馬のない馬車のアナロジーが当てはまると述べています。彼らは、AIを既存のワークフローにレイヤー化していますが、スレッドを引っ張ると、そのワークフローが存在すべきではない理由がますます多くなることがわかります。Karrot_Kreamは、これらのAI機能の多くが「馬のない馬車」のようなものである理由は、内部でインセンティブが与えられた方法にあると考えています。kfajdslは、友人がカスタムWebメールクライアントを作成し、記事が取り上げていることを基本的に行っていることを共有しました。彼は、Microsoft、Google、Appleなどの巨大企業がAIを製品に統合するのが非常に下手であることに困惑しています。\n\n## 費用便益分析\n\nximengは、このページのすべてのLLMウィジェットを実行するユーザーは約1セントかかると見積もっています。これが10,000回のページビューに達すると、費用がかかり始めます。pmarreckは、ローカルで実行されるLLMは、現時点では十分にまともなジョブを実行できる可能性があることを示唆しています。\n\n## まとめ\n\n全体として、スレッドの参加者は、既存の製品に統合されたAI機能の有用性について意見が分かれています。一部の人は、AIノートテイカーやコーディングアシスタントなどのユースケースは役立つと考えていますが、他の人は多くのAI機能が使い物にならず、価格も法外であると考えています。多くの人は、大企業が過度に慎重であり、ユーザーに最大限の価値を提供しない、控えめなAIの実装をリリースしていると感じています。参加者は、AIの責任ある倫理的な使用の必要性と、単純にすべてにAIを追加するのではなく、AIによって解決される問題について批判的に考えることの重要性を強調しています。"
}