{
  "comments_id": "44031385",
  "rank": 1,
  "title": "The Windows Subsystem for Linux is now open source",
  "link": "https://blogs.windows.com/windowsdeveloper/2025/05/19/the-windows-subsystem-for-linux-is-now-open-source/",
  "created_date": "2025-05-19T20:13:05.844262",
  "comments_summary": "WSL (Windows Subsystem for Linux) is now open source, sparking discussions about its implications, benefits, and drawbacks compared to native Linux and other virtualization solutions.\n\n## Microsoft Layoffs and Open Source Strategy\nSome speculate whether the open-sourcing of WSL is related to recent layoffs at Microsoft, while others believe it's a long-term strategic move, potentially to tap into a larger pool of community contributors and promote the adoption of Microsoft's cloud services. There is debate on the extent to which the layoffs are performance based or affect specific projects.\n\n## Open Source and Microsoft's Motives\nThe discussion includes whether companies open-source primarily for their own benefit, such as gaining access to free labor and expanding the reach of their platforms. Some users view Microsoft's increasing involvement in open source positively, while others remain skeptical, citing past anti-open-source behavior and concerns about telemetry, ads, and control over user experience. Some users suspect that Microsoft will \"embrace, extend, and extinguish\" the project.\n\n## WSL vs Native Linux\nMany commenters discuss WSL in comparison to native Linux, with strong opinions on both sides. WSL is praised for its convenience, ease of setup, and ability to run Linux environments alongside Windows applications. However, some users find WSL janky, slower (particularly with file system access), and prone to various issues like networking problems and conflicts with other software. They prefer running Linux directly or using other virtualization solutions like VMware or Docker. WSL is often compared to running Linux in a VM.\n\n## WSL's Strengths and Weaknesses\nWSL's file system performance and networking issues are frequently mentioned. There is also discussion about whether to use WSL1 or WSL2, each having its own advantages and disadvantages. The integration of WSL with Windows is seen as a major benefit, but some users dislike the tight coupling with Windows and its associated telemetry and update policies.\n\n## Linux on Apple Silicon and Other Platforms\nThe conversation extends to the challenges of running Linux on Apple Silicon and the availability of alternative solutions like Lima and OrbStack. The discussion also touches on the difficulty of achieving a seamless user experience with Linux on laptops, citing issues with hardware support, power management, and graphical environments.\n\n## Windows vs. Linux\nMany users express their preference for Linux as a development environment, citing concerns about Microsoft's user-hostile behavior, telemetry, and forced updates. Others acknowledge the benefits of WSL but state they would prefer to run Windows in a VM from Linux if possible, for greater control over the system.\n\n## License and Copyright\nThere is some discussion about the MIT license under which WSL is being released, specifically regarding copyright ownership of changes and the potential for Microsoft to exert control over community contributions.\n\n## Summary\nThe comments reflect a wide range of opinions on WSL, its usefulness, and Microsoft's motivations for open-sourcing it. While some users find WSL to be a game-changer for development on Windows, others prefer native Linux or other virtualization solutions due to concerns about performance, control, and Microsoft's overall approach to user experience. The conversation also highlights the ongoing debate about the merits of Windows vs. Linux as a development platform and the challenges of achieving a seamless and productive environment on either operating system."
}