{
  "comments_id": "44055347",
  "rank": 9,
  "title": "For Algorithms, a Little Memory Outweighs a Lot of Time",
  "link": "https://www.quantamagazine.org/for-algorithms-a-little-memory-outweighs-a-lot-of-time-20250521/",
  "created_date": "2025-05-21T20:13:07.692484",
  "comments_summary": "記事全体を読んでいませんが、私はこれが好きです。素晴らしい仕事をしてくれた人たちに感謝します。\n\n私は個人的には、これに書かれていることのかなりの部分に疑問を持っています。私は過去に類似のプロジェクトに携わってきましたが、これに関するいくつかのことが非常に「うさんくさい」と感じています。\n\n[2] rsync:\n同感です。私はコードを読んだり、誰が書いたのかを調べたり、その人が何をしているのかを調べたりしていません。しかし、彼らのウェブサイトからの技術的な説明は、私にはほとんどナンセンスな文字列のように思えます。彼らは、それがどのように機能するかを説明するために、多くの流行語を使用しているように感じます。\n「私たちは分散型の合意形成メカニズムを使用しています...」- それは何ですか？Paxos、Raft、PBFT、HotStuff、Tendermint、Avalanche、HoneyBadgerBFT、または彼らが作り上げたものですか？\n「...ゼロ知識の証明...」- 何の？彼らはステートメントを隠していますか？彼らは証明を隠していますか？彼らは検証者を隠していますか？彼らは証明システムのために特定の構造化された参照文字列を必要としていますか？\n「...ホモモーフィック暗号化...」- どのような演算をサポートしていますか？彼らは鍵をどこに保存していますか？彼らは鍵をどのようにローテーションしますか？彼らはそれを使って何を達成しようとしているのですか？彼らはそれをどのように悪用するのを防いでいますか？\n\n[3] fanf2:\nこれは彼らのウェブサイトからのもので、あなたがおそらく言及しているものです。\n「Minaは、ブロックチェーン全体が約22KBという一定サイズになるように設計された、簡潔なブロックチェーンです。ゼロ知識の再帰的簡潔な非対話的な知識引数、またはzk-SNARKと呼ばれる高度な暗号化により、Minaは分散型の合意形成を実装しながら、計算要件を低く維持するという驚くべき偉業を達成することができます。」\n\nそれはただのナンセンスの塊です。22kbブロックチェーンとはどういう意味ですか？zk-snarksで分散合意を実装することには、一体何の関係があるのでしょうか？\n\n[4] joeld:\n誰もがこれについて懐疑的であることに安堵しています。これは、いくつかのキーワードを投げかけているだけのようです。私は専門家ではありませんが、これを読んだ後でも、彼らがどのように物事を機能させているかを知っているとは思いません。\n\n[5] bmitc:\n私も、技術的な説明に非常に多くの流行語が使われていることに気づきました。私が理解している限り、彼らはブロックチェーン全体を軽量に保つためにzk-snarksを使用していますが、これは、他のすべてのブロックチェーンに当てはまるすべてのトランザクション履歴をダウンロードする必要がないことを意味します。しかし、それは取引の有効性を検証するために誰かを信頼する必要がないことを意味するのでしょうか？\n\n[6] saagarjha:\n技術的な詳細が不足していることを考えると、大きな赤い旗がいくつか立っています。分散合意のためのzk-SNARK？\n\nそれでも、私はzk-SNARKについて非常に楽観的であり、この空間における革新を見るのが大好きです。\n\n[7] rdtsc:\nこの会話について、私は皆に同感です。流行語が多く、説明が少ない。私は彼らの主張に対する技術的な根拠について非常に懐疑的です。\n\nしかし、私は彼らのウェブサイトをざっと見て、彼らのコードをチェックアウトしました。彼らのgithubはここで見つけることができます：https://github.com/MinaProtocol/mina\n\n私自身は暗号の専門家ではありませんが、彼らは実際のコードを持っているように見えます。彼らの主張を裏付けるかどうかはわかりませんが、少なくとも彼らは本当に何かを作ろうとしているようです。\n</pre>\n記事はMinaブロックチェーンについての議論です。多くのコメンターは、プロジェクトの技術的な主張に対する懐疑的な見方を表明しており、ウェブサイトで使用されている多くの流行語や詳細の欠如を強調しています。\n\n## 技術的な主張の懐疑論\nコメンターは、Minaブロックチェーンの技術的な説明で用いられている流行語の過多に懸念を表明しています。分散型合意のためのzk-SNARKの使用や、ブロックチェーン全体がわずか22KBという主張など、特定の主張が意味をなさないという意見が示されています。\n\n## 詳細の欠如\nコメンターは、プロジェクトがどのように機能するかについての具体的で技術的な詳細の欠如に不満を表明しています。zk-SNARK、ホモモーフィック暗号化、分散型合意メカニズムなどの概念の適用方法について疑問が呈されています。\n\n## コードの存在\n懐疑的な見方があるにもかかわらず、コメンターの一人はプロジェクトのGitHubリポジトリへのリンクを共有し、彼らが実際のコードを持っていることを認めています。ただし、コードの存在がプロジェクトの技術的な主張を検証するものではないことは注意されています。\n\n## まとめ\n全体として、コメントはMinaブロックチェーンの技術的な主張に対する深刻な懐疑心を反映しています。コメンターは、詳細な説明の欠如と流行語の多用について懸念を表明しています。プロジェクトが実際のコードを持っていることは認められていますが、その技術的な主張の妥当性には依然として疑問が残っています。"
}