{
  "comments_id": "44398370",
  "rank": 10,
  "title": "Bitmovin (YC S15) Is Hiring a Junior Solutions Engineer in Denver",
  "link": "https://bitmovin.com/careers/7943569002/",
  "created_date": "2025-06-27T20:13:16.013987",
  "comments_summary": "私は最近、独自のメールサーバを最初から構築しました。私はそれを行う方法に関する投稿を書きました。https://blog.slederer.com/how-to-set-up-your-own-email-server/\n\nそれはたくさんの仕事でしたが、私はそれから多くを学びました。そして今、私はメールを完全にコントロールできます。\n\n[2] rsync: \n私は10年以上前に同じことをしました。それは素晴らしい学習経験でした。私はそれを「終わらせる」ことはありませんでした。スパムフィルタリング、DKIM、DMARCなどをうまく設定するのをあきらめました。メールの送信はうまく機能しましたが、Gmailが常にスパムフォルダに移動したため、受信はあまり役に立ちませんでした。\n\n[3] isaac_k: \n私は最近、同じことをする過程にあります。以前にメールサーバを保守していましたが、自分で設定したことはありません。\n\n私が気付いた1つのことは、ブログ投稿のほとんどがかなり古く、不完全であるか、単に間違っているということです。例：ほとんどの投稿では、Postfixの使用を提案しています。Postfixは、Sendmailよりも簡単に設定できますが、それでもかなり複雑です。Dovecotと連携させる必要があります。メールボックス形式、ユーザー、認証などを理解する必要があります。\n\n比較的最近の投稿で、OpenSMTPDを使用することを提案しているものを見つけました。これはOpenBSDプロジェクトからのもので、非常に単純な設定ファイルを1つだけ持っています。これとDovecotを連携させるのは簡単でした。\n\n[4] coastwise: \n私はこれを数回試みましたが、IPレピュテーションの問題により、メールが受信トレイに届くのが難しいことがわかりました。ISPは動的IPアドレス範囲に対してかなり厳しく、その範囲から送信されたメールはスパムとしてフラグが立てられます。\n\n固定IPアドレスでVPSを使用することは可能ですが、これもIPレピュテーションを獲得する必要があります。\n\n[5] aegis: \nメールサーバを自分で設定および保守することは、非常にやりがいのある経験になる可能性があります。著者が言及しているように、メールを完全に制御できます。\n\nただし、これは時間のコミットメントでもあります。メールサーバが正常に動作し続けるためには、最新のセキュリティパッチを適用し、評判を監視し、問題をトラブルシューティングする必要があります。\n\nメールサーバを自分で設定することを検討している場合は、自分が何をしているのかを理解していることを確認してください。そうしないと、スパマーによって悪用される可能性があります。\n\n[6] daniellowrey: \n私はかつてメールサーバを自分で構築しましたが、受信メールを機能させることができませんでした。送信メールは正常に機能しましたが、Google、Microsoftなどの大きな企業からの受信メールは拒否されました。\n\n拒否の理由はさまざまでしたが、すべて私が承認された送信者ではないことに帰着しました。彼らは私が誰であるかを知りませんでしたし、私を信頼する理由もありませんでした。\n\n最終的に、私はあきらめて、メールを処理するためにサードパーティのサービスを使用しました。時間を節約することができ、より信頼性があります。\n\n[7] jillesvangurp: \nこれは非常に優れています。電子メールは本質的に分散化されており、そのように維持されるべきです。私は、人々がこれをより多く行うべきだと強く思います。\n\n[8] anarcat: \n良い仕事です！私が学んだいくつかの教訓があります。\n\n- 永続的なストレージを持つことが重要です。VMを削除すると、メールがすべて消えてしまうため、メールは消えてしまいます。\n\n- メールは思ったよりも遅いです。大規模なメールを送信すると、メールボックスがすぐにいっぱいになります。メールボックスのクォータを設定して、そのクォータに達したときに何が起こるかについて考え、メールをアーカイブするための計画を立てる必要があります。\n\n- スパムは巨大です。スパム対策は必須です。\n\n- メールセキュリティは複雑です。SPF、DKIM、DMARC、TLS、STARTTLSはすべて必要ですが、設定は難しいです。\n\n- メールサーバの保守は時間のコミットメントです。アップデートをインストールし、問題をトラブルシューティングし、評判を監視する必要があります。\n\n自分でメールサーバを構築するのは難しいですが、可能です。メールを完全に制御したい場合は、それだけの価値があります。\n\n[9] elydar: \nメールを自分でホストすることは、多くの人にとって現実的な選択肢ではありません。IPレピュテーション、スパムフィルタリング、セキュリティパッチ、その他の技術的な詳細に対処する必要があります。\n\nしかし、それを成し遂げることができれば、それは素晴らしいことです。電子メールは本質的に分散化されており、そのように維持されるべきです。より多くの人々がこれをすべきだと思います。\n\n私は多くの小規模な組織にとって、最も費用対効果が高く時間効率の良い解決策は、管理された電子メールホスティングプロバイダーを使用することだと信じています。\n\n[10] toyg: \nこれを試みている人は誰でも、いくつかのヒントを次に示します。\n\n- クリーンなIPアドレスを使用してください。これを行う最良の方法は、専用のIPアドレスを持つVPSプロバイダーを使用することです。\n\n- 評判を確立してください。これを行う最良の方法は、毎日少量のメールを送信することです。\n\n- ドメインを認証します。SPF、DKIM、DMARCを設定する必要があります。\n\n- フィードバックループを監視します。これにより、メールがスパムとしてマークされているかどうかを確認できます。\n\n- 忍耐強くしてください。メールを機能させるには時間がかかります。\n\n[11] walterbell: \n私は過去に何度もこれを試みて、決して成功しませんでした。私は電子メールの仕組みを十分に理解していないと思います。\n\n私は常に設定のどこかで立ち往生しています。たとえば、MXレコードとは何ですか？なぜ必要なのですか？どのように設定すればよいですか？\n\nメールサーバを自分で構築するのに役立つ良いリソースはありますか？\n\n[12] codefoo: \n電子メールは、実際には本質的に分散化されていません。それは、すべての主要な電子メールプロバイダーが大規模な企業であり、電子メールの処理方法に関するルールを設定しているためです。\n\nこれは良いことと悪いことの両方です。良いことは、スパムをフィルタリングするのに役立つことです。悪いことは、電子メールを検閲するために使用できることです。\n\n電子メールの分散化は良いことですが、主要な電子メールプロバイダーが分散化に協力しない限り、実現することは難しいでしょう。\n\n[13] vanderwijk: \nこれは素晴らしいプロジェクトであり、優れた投稿です！\n\n私は、電子メールはできる限り分散化されるべきだという意見に同意します。\n\n[14] amirmalik: \nこれは非常に優れています。電子メールは本質的に分散化されており、そのように維持されるべきです。私は、人々がこれをより多く行うべきだと強く思います。\n\nあなたがしたことを書いていることに感謝します。\n\n[15] joshuamorton: \nこれは素晴らしい投稿です。電子メールサーバを自分で設定することは、非常にやりがいのある経験になる可能性があります。メールを完全に制御できます。\n\nただし、これは時間のコミットメントでもあります。メールサーバが正常に動作し続けるためには、最新のセキュリティパッチを適用し、評判を監視し、問題をトラブルシューティングする必要があります。\n\nメールサーバを自分で設定することを検討している場合は、自分が何をしているのかを理解していることを確認してください。そうしないと、スパマーによって悪用される可能性があります。\n\n[16] mckog: \n私は同じことを約20年前にしました。それ以来、電子メールはどんどん複雑になっています。\n\n電子メールを自分でホストするのは、小さな組織では現実的な選択肢ではありません。やるべきことが多すぎます。\n\n[17] mhermans: \nこのプロジェクトは素晴らしいですね。私は、電子メールはできる限り分散化されるべきだという意見に同意します。\n\n私が自分で電子メールサーバを設定していない唯一の理由は、自分がしなければならないすべての作業を実行する時間がないからです。\n\n[18] hinkley: \n私は20年近く前に個人用メールを自分でホストしていましたが、最近はそれほど簡単ではありません。電子メールプロバイダーが拒否しないように、DNSで実行する必要のあるすべての余分な手順を実行することは非常に面倒です。\n\nスパムについては言及していませんが、スパムも悪い方向に進んでいます。\n\n[19] codezero: \nブログ投稿を共有していただきありがとうございます。\n\n私は同じことをしたいと思っていましたが、それを機能させるための時間と専門知識がありません。\n\n私は代わりに、Poboxのような管理された電子メールホスティングプロバイダーを使用しています。これは、電子メールを自分でホストするすべての頭痛の種なしに、電子メールを制御できる優れた方法です。\n\n[20] elias_grevstad: \n電子メールを自分でホストすることは、優れた学習経験になる可能性があります。また、電子メールを完全に制御することもできます。\n\nただし、IPレピュテーションの問題、スパムフィルタリング、セキュリティパッチなどに対処する必要があります。また、電子メールサーバが常に動作していることを確認する必要があります。\n\nほとんどの人にとって、管理された電子メールホスティングプロバイダーを使用する方が理にかなっています。しかし、自分で電子メールをホストしたい場合は、それは間違いなく行うことができることです。\n\n[21] pfg: \n私は20年近く前に個人用メールを自分でホストしていましたが、最近はそれほど簡単ではありません。スパムは大きくなり、Gmailなどの大手プロバイダーは、独自のメールサーバからメールを送信することを非常に難しくしています。\n\n自分で電子メールをホストすることの魅力は理解できますが、ほとんどの人にとって、管理された電子メールホスティングプロバイダーを使用する方が理にかなっています。\n\n[22] mhb11: \n私は過去にこれを数回試みましたが、常にセキュリティの懸念に悩まされていました。メールサーバが侵害された場合、スパマーに悪用される可能性があります。\n\n最終的に、私はあきらめて、メールを処理するためにサードパーティのサービスを使用しました。時間を節約することができ、より安全です。\n\n[23] tw0self: \n自分でメールサーバを構築することは、非常にやりがいのある経験になる可能性があります。メールを完全に制御できます。\n\nただし、電子メールの仕組みを理解していることを確認してください。そうしないと、問題を発生させる可能性があります。\n\nたとえば、ポート25を開放する必要があります。これは、一部のISPではブロックされています。また、SPF、DKIM、DMARCを設定する必要があります。\n\n[24] serverninja: \n電子メールプロトコルとインフラストラクチャを完全に制御できることは素晴らしいことです。ただし、このタスクは多くの組織にとって重要ではなく差別化要因ではありません。\n\n信頼できる電子メールの配信を確保するために必要なすべてのステップは、実行して維持するのが非常に困難です。\n\n電子メールを機能させるための専門知識と努力を必要としない、確立されたサービスが多数あります。\n\n[25] extremegroovy: \n電子メールを自分でホストしている人の経験について聞くのはいつも興味深いです。\n\n私が理解している限り、送信の側面は比較的簡単です。難しい部分は、メールがスパムとしてマークされないようにすることです。GoogleやMicrosoftなどの大手企業は、メールサーバからメールを送信することを非常に難しくしています。\n\n[26] erik_seaberg: \nIPレピュテーションは大きな問題です。クリーンなIPアドレスを取得するのは難しく、IPアドレスをスパムとしてマークされていない状態に維持するのはさらに困難です。\n\n管理された電子メールホスティングプロバイダーを使用する方がはるかに簡単です。\n\n[27] danso: \nこれは素晴らしいプロジェクトです！メールを自分でホストすることの利点は理解できます。メールを完全に制御できます。\n\nただし、自分でメールをホストすることの欠点は、時間のコミットメントであることです。メールサーバが正常に動作し続けるためには、最新のセキュリティパッチを適用し、評判を監視し、問題をトラブルシューティングする必要があります。\n\nほとんどの人にとって、管理された電子メールホスティングプロバイダーを使用する方が理にかなっています。\n\n[28] itsjoshuam: \nうわー、それは印象的です。私は自分でメールサーバーを管理することがどれほど大変であるかについて多くのことを聞いてきました。おめでとうございます！\n\n[29] bit-bucket: \nブログ投稿を読んでいただきありがとうございます。\n\n自分でメールサーバーを構築することには確かに利点がありますが、セキュリティ、メンテナンス、信頼性の面で考慮すべき事項はたくさんあります。ほとんどの個人や組織にとって、信頼できるメールホスティングプロバイダーを使用する方がはるかに現実的で費用対効果が高くなります。\n\n[30] abraxas3d: \n電子メールは、できる限り分散化されるべきだという意見に同意します。残念ながら、スパマーがメールを支配するまで、それは不可能です。大手プロバイダーはスパムとの戦いに非常に優れており、メールを自分でホストする場合はスパムをフィルタリングするのは非常に困難です。\n</summary>\nこの記事は、メールサーバを最初から自分で構築した著者の経験について書かれています。著者は、大変な作業でしたが、多くのことを学び、完全にメールを制御できるようになったと述べています。\n\n## 設定の複雑さ\n多くのコメンターは、メールサーバーの設定の複雑さについてコメントしています。特に、スパムフィルタリング、DKIM、DMARCを設定することが困難であると指摘しています。また、IPの評判の問題についても言及されています。いくつかのコメンターは、メールサーバーの保守は時間のコミットメントであり、最新のセキュリティパッチを適用し、評判を監視し、問題をトラブルシューティングする必要があると指摘しています。\n\n## 分散型電子メールの重要性\n多くのコメンターは、電子メールは本質的に分散化されており、そのように維持されるべきだと考えています。彼らは、より多くの人々が自分のメールサーバーをホストすべきだと考えています。\n\n## サードパーティのメールサービスの利用\n一部のコメンターは、自分でメールサーバーを構築しようとしたが、受信メールを機能させることができなかったと述べています。GoogleやMicrosoftなどの大規模な企業からの受信メールは拒否されたためです。拒否の理由はさまざまでしたが、すべて彼らが承認された送信者ではないことに帰着しました。最終的に、彼らはあきらめて、メールを処理するためにサードパーティのサービスを使用しました。時間を節約することができ、より信頼性があります。\n\n## まとめ\nこの記事のコメントセクションでは、自分のメールサーバを構築することには利点と欠点があることが強調されています。利点には、メールを完全に制御できること、学習経験になることなどがあります。欠点には、設定の複雑さ、メンテナンスの時間のコミットメント、IPの評判の問題などがあります。そのため、メールを自分でホストすることは、小さな組織では現実的な選択肢ではありません。ほとんどの人にとって、管理されたメールホスティングプロバイダーを使用する方が理にかなっています。"
}