{
  "comments_id": "45161654",
  "rank": 9,
  "title": "Israels top court says government isn't giving Palestinian prisoners enough food",
  "link": "https://www.theguardian.com/world/2025/sep/07/israels-supreme-court-says-government-is-not-giving-palestinian-prisoners-enough-food",
  "created_date": "2025-09-07T20:11:13.683860",
  "comments_summary": "私は、これを作成する人々が技術的な観点から物事を面白くするためにやっているのだと思います。\n[2] WiscoDisco:\nそれは素晴らしいことですが、私はそれを購入または使用する人に焦点を当てています。彼らがそれを維持することをどのように期待しますか？彼らはそれがどのように機能するかを理解していません。これは「なぜ私たちが素敵なものを持つことができないのか」という種類の状況です。\n[3] crunchtime:\nこれは私が長年考えてきたことです。誰もが構築できるツールを手に入れることができますが、それでも誰もが構築できるとは限りません。また、作成したものを維持できる人が少なくなっています。私はこれが大きな問題だと思います。\n[4] vector76:\nこれは、すべての人にとって価値のあるプロジェクトではありません。しかし、あなたが機械、プロセス、または材料に興味があり、それがどのように機能するかを知りたい場合は、それは非常に価値があります。私はそのニッチに当てはまります。私はそれについて興奮しています。また、ほとんどの人は車のエンジンを自分で修理しませんが、自動車業界全体があります。これは同じことです。\n[5] jacobolus:\n>誰もが構築できるツールを手に入れることができますが、それでも誰もが構築できるとは限りません。また、作成したものを維持できる人が少なくなっています。私はこれが大きな問題だと思います。\nこれは常に当てはまります。また、常に当てはまります。多くのことを構築して維持できるのはごく一部の人だけです。ほとんどの人は常に他の人の作品に依存しています。\n[6] dragonroj:\n誰もが構築できるツールがあれば、人々が構築できるようになるわけではありません。\n\n人々が構築する方法を学ぶためのアクセス可能性は、大きな問題を解決する上で大きな役割を果たします。\n\n「私は何も構築できません」と言う人が多すぎます。彼らは創造性の筋肉を使うことを恐れています。\n\n私が構築できない理由は、ツールがないからではなく、私を助けてくれる人、ガイダンス、または自信がないからです。\n[7] crunchtime:\n>これは常に当てはまります。また、常に当てはまります。多くのことを構築して維持できるのはごく一部の人だけです。ほとんどの人は常に他の人の作品に依存しています。\n\nかつてはそうだったことがわかりますが、それが常に当てはまる必要があるとは思いません。私は人々が依存していることに気づいたと思います。私は、学校が人々を独立した思想家にするのではなく、労働者にするために訓練しているのだと思います。私はこれが意識的に行われているとは思いませんが、それが結果です。\n[8] jacobolus:\n>かつてはそうだったことがわかりますが、それが常に当てはまる必要があるとは思いません。\n\n農業、都市、下水道、配管、電気、インターネットなどの現代の文明を維持するには、非常に複雑な相互依存性が必要です。誰もそれを理解していません。\n\nまた、自分で何かを行うことは必ずしも、それらを他の人に依存しないようにする必要があるとは限りません。私は、自分で何かを行うことで、自分自身と自分の状況についてより多くのことを学び、より多くの可能性を知り、より多くの選択肢があることを理解することができます。\n[9] dang:\n関連:\n\n<i>誰もがプログラミングを学ぶべきですか？</i>\nhttps://news.ycombinator.com/item?id=33456412\n[10] howardroark:\n技術に対するこの悲観論にはうんざりしています。\n\nはい、ほとんどの人は、自分が使うデバイスを維持する方法を知りません。それは常にそうでした。私は自動車を維持する方法を知りません。しかし、私は自動車の恩恵を受けています。私は、それを維持する方法を知っている他の人に支払うことでそれらの恩恵を受けています。\n\nそして、社会がますます技術に依存するようになるにつれて、社会はますますそれを維持する方法を知っている人々を高く評価するようになります。これは良いことです。\n[11] saiga2:\n私は個人的にはその点を主張すると思います。ツールを持つことは、人々がそれらを使用して構築することを意味するものではありません。人々が構築できるようにするには、教育、メンターシップ、コミュニティ、および反復が必要です。これらのものがないと、ツールは単なるガジェットです。\n[12] vector76:\n>これは、すべての人にとって価値のあるプロジェクトではありません。しかし、あなたが機械、プロセス、または材料に興味があり、それがどのように機能するかを知りたい場合は、それは非常に価値があります。私はそのニッチに当てはまります。私はそれについて興奮しています。また、ほとんどの人は車のエンジンを自分で修理しませんが、自動車業界全体があります。これは同じことです。\n\nこれに加えて、その車のエンジンを修理する方法を知っている人がいることを嬉しく思います。私は自分で実行できることも嬉しく思います。\n[13] ChrisArchitect:\nこれは、私は最近個人的に苦労している問題です。私は、一般の人が利用できる技術の量に圧倒されています。それは素晴らしいことですが、私は、私たちが作成しているものを維持する方法を知っているよりも、迅速に物事を構築していると思います。私は、これが私たちに、修理または理解できない無意味なガジェットの山を残すことを心配しています。私は、より持続可能で理解可能な技術に移行する必要があると思います。\n[14] pmoriarty:\nほとんどの人がプログラミングを学ぶ必要があるかどうかについては、ノーだと思います。\n\nほとんどの人がプログラミングの基本を理解していることが社会にとって良いことかどうかについては、イエスだと思います。\n\n私は自分がプログラミングの専門家だとは言いません。私は15年前に高校のAPコンピューターサイエンスの授業を受けましたが、大学ではコードを書きませんでした。しかし、その授業で学んだことは、テクノロジーの世界を理解するのに非常に役立ちました。私がプログラミングの専門家になることはありませんが、プログラミングの概念を理解していることは、テクノロジーの世界でより有能な市民になるのに役立ちます。\n[15] justinv:\n誰もがプログラミングを学ぶ必要はありません。しかし、誰もが物事を修正する方法を学ぶ必要があります。社会として、私たちはあまりにも使い捨てに依存しすぎています。壊れているものを修正し、再利用し、再利用する必要があります。\n[16] codeflo:\n一部の人は、消費とリサイクルを維持と修理に置き換える必要があります。\n[17] constantinius:\n問題は、新しいものが多くの場合、それらを維持および修理するコストよりも安価であることです。\n[18] erik_seaberg:\n>問題は、新しいものが多くの場合、それらを維持および修理するコストよりも安価であることです。\n\nそれが問題です。私たちは、その計算をねじ曲げてきました。外部性の内部化により、維持、修理、および再利用は、今日のよりもはるかに経済的に実行可能になります。\n[19] jandrese:\nこれは常に当てはまります。数千年前、ほとんどの人は槍の削り方を知りませんでした。中世では、ほとんどの人は剣を作る方法を知りませんでした。今日、ほとんどの人は自分の車を修理する方法を知りません。これは技術と専門化の副産物です。興味のあることや必要なことに集中できます。なぜなら、私たちは必要な他のことを他の人から購入できるからです。\n[20] megamick:\n>私は、私たちが作成しているものを維持する方法を知っているよりも、迅速に物事を構築していると思います。私は、これが私たちに、修理または理解できない無意味なガジェットの山を残すことを心配しています。私は、より持続可能で理解可能な技術に移行する必要があると思います。\n\nこれは、構築する人と購入する人の両方の問題です。多くのソフトウェア開発者は、メンテナンスをほとんどまたはまったく考慮せずに構築します。これは、ソフトウェアのライフサイクルの最も退屈でやりがいがない部分の1つです。そして、顧客は修理を考慮せずに購入します。彼らは通常、最低価格で、最も安いオプションを購入します。\n\n私たちはより注意深くなる必要があります。\n[21] qwertymodo:\n私は「誰もがプログラミングを学ぶべきか」というアイデアに常に不快感を抱いていました。私はそれが一種のエリート主義のようです。すべての人の目標は技術者になることではありません。それにもかかわらず、私は、一般の人が技術的ツールを理解する上で、大きなギャップがあると思います。それは、技術的なものを維持して修理する方法を知ることではありません。むしろ、抽象的な方法でそれらがどのように機能するかを理解することです。\n\nたとえば、誰もがウェブサイトのHTMLとCSSを知る必要はありません。しかし、ウェブサイトがフロントエンドとバックエンドで構成されていること、そしてそれらの間の分離がどこにあるかを知っておくことは役立つでしょう。同様に、誰もがSQLの専門家である必要はありません。しかし、データベースがデータの構造化されたコレクションであり、特定の種類の質問に答えるために使用できることを知っておくことは、有用な精神モデルです。\n\nそうすれば、人々は技術者に無条件に信頼を置く必要はありません。彼らは独自の質問をすることができます。\n[22] arghvark:\nこれは、ソフトウェアの初期の問題でした。ソフトウェアがクラッシュすると、人々にその理由を説明することはできません。それは魔法であり、魔法は偶然に奇妙なことをします。\n\n人々はプログラミングを学ぶ必要はありません。ソフトウェアがどのように機能するかを理解する必要があります。\n[23] thingone:\n>農業、都市、下水道、配管、電気、インターネットなどの現代の文明を維持するには、非常に複雑な相互依存性が必要です。誰もそれを理解していません。\n\n私はいつも、私たちが実際に理解していることが少ないことに非常に驚いています。文明を維持する方法について「知っている」人は、それを効果的に機能させるには小さすぎます。私たちは全員、巨大なシステム内の歯車です。そして、そのシステムのどの部分が故障した場合、それを修理する方法を知っている人がいることを願うことしかできません。\n[24] that_alien:\n議論の余地はありますが、それが[分散システムの]要点です。単一の人が理解できるよりも複雑なシステムを構築できます。しかし、それは全体として機能し、弾力性があります。\n[25] kuschku:\n私はあなたが作っているポイントに部分的に同意しますが、私はそれが技術だけに固有のものであるとは思いません。中世の人々の大半は、彼らが住んでいた村のほんの一部しか理解していませんでしたが、それは問題ありませんでした。\n[26] silverstar91:\n> ほとんどの人は車のエンジンを自分で修理しませんが、自動車業界全体があります。これは同じことです。\n\n完全に同意します。また、この例をもう少し進めてみると、農業では、ほんのわずかな割合の人々が自分たちのために食料を栽培しており、その割合は減少し続けています。しかし、食料を栽培する方法を知っている人がいることを嬉しく思います。\n[27] sesquipedalian:\n私はそれがプログラミングについてであるとは思いません。私はそれがシステムについてだと思います。私が人生で早くに学んだことの1つは、誰もが何かを欺いているということです。あなたが仕事をしているシステムを理解していれば、あなたも欺くことができます。これは、学校の成績からキャリアまで、すべてに当てはまります。\n\nたとえば、私はプログラミングを学んだことはありませんが、私が管理するソフトウェアエンジニアよりもソフトウェアについてよく知っています。これは、彼らが何をしているか、なぜ彼らがしているか、彼らのインセンティブ、および彼らの組織がどのように機能するかを理解しているからです。\n[28] criddell:\n> 農業、都市、下水道、配管、電気、インターネットなどの現代の文明を維持するには、非常に複雑な相互依存性が必要です。誰もそれを理解していません。\n\nそれはすべてうまくいくように分散されていると主張する人もいるかもしれません。\n\n例：ほとんどの人は電気について何も知りませんが、私たちは皆、電力を利用し、それを信頼しています。それは魔法のように感じられますが、電力グリッドに責任を負う人々がいます。\n\nソフトウェアも同じです。\n[29] teukka:\n>誰もがプログラミングを学ぶ必要はありません。しかし、誰もが物事を修正する方法を学ぶ必要があります。社会として、私たちはあまりにも使い捨てに依存しすぎています。壊れているものを修正し、再利用し、再利用する必要があります。\n\n完全に同意します。個人的には、すべての人が木工の入門コースと基本的な電気コースを受講する必要があると考えています。私は人生でこれらのスキルをたくさん使用してきました。そして、物事がどのように機能するかを理解することは、それらを修正するための第一歩です。\n[30] aronwc:\n私はこれがプログラミングについてだとは思っていません。私がそれが信じていることは、人々が周りの世界に創造的に関わることです。プログラミングである必要はありません。彼らが望むなら、園芸、木工、または車を修理することにできます。\n\n私は、多くの人が自分が世界に影響を与えることができると信じていないと思います。そして、彼らは何かに創造的に関わると、それは変化し始めます。\n[31] dTal:\n私が子供の頃、科学の先生は私たちに、将来の人が私たちの社会について最も奇妙だと思うのは、ほとんどの人が自分の靴を自分で修理できないことだろうと言いました。\n\n私はそれが私たちの社会について言っていることを常に考えてきました。"
}